Conf.Simple/src/InformationRegisters/SUI_ПотокШтрихкодов/SUI_ПотокШтрихкодов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>SUI_ПотокШтрихкодов</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>МобильноеУстройство</name>
    <type>
      <types>ExchangePlanRef.SUI_МобильныеУстройства</types>
    </type>
  </attributes>
  <attributes>
    <name>МеткаВремени</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>16</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ДокументОбмена</name>
    <type>
      <types>DocumentRef.SUI_ДокументОбмена</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Штрихкод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторЗаписи</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Conf.Simple/src/Enums/SUI_ТаблицыИнтеграции/SUI_ТаблицыИнтеграции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>SUI_ТаблицыИнтеграции</name>
  <enumValues>
    <name>Контрагенты</name>
  </enumValues>
  <enumValues>
    <name>Склады</name>
  </enumValues>
  <enumValues>
    <name>Ячейки</name>
  </enumValues>
  <enumValues>
    <name>Номенклатура</name>
  </enumValues>
  <enumValues>
    <name>ХарактеристикиНоменклатуры</name>
  </enumValues>
  <enumValues>
    <name>СерииНоменклатуры</name>
  </enumValues>
  <enumValues>
    <name>ЕдиницыИзмерения</name>
  </enumValues>
  <enumValues>
    <name>УпаковкиНоменклатуры</name>
  </enumValues>
  <enumValues>
    <name>ВидыНоменклатуры</name>
  </enumValues>
  <enumValues>
    <name>ШтрихкодыНоменклатуры</name>
  </enumValues>
  <enumValues>
    <name>ШтрихкодыУпаковок</name>
  </enumValues>
  <enumValues>
    <name>Документы</name>
  </enumValues>
  <enumValues>
    <name>НастройкиДокументов</name>
  </enumValues>
  <enumValues>
    <name>ШаблоныЭтикеток</name>
  </enumValues>
  <enumValues>
    <name>ПользователиТСД</name>
  </enumValues>
</mdclass:Enum>

Conf.Simple/src/InformationRegisters/SUI_ПотокШтрихкодов/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ЗагрузитьПоток(МобильноеУстройство, ДокументОбмена, ДанныеПотока) Экспорт
	
	Для Каждого СтрокаДанныхПотока Из ДанныеПотока Цикл
		
		Запись = СоздатьМенеджерЗаписи();
		
		Запись.Период = ТекущаяДатаСеанса();
		Запись.ДокументОбмена = ДокументОбмена;
		
		Запись.ИдентификаторЗаписи = СтрокаДанныхПотока.id;
		Запись.Штрихкод = СтрокаДанныхПотока.barcode;
		Запись.Количество = СтрокаДанныхПотока.qty;
		
		Запись.МобильноеУстройство = МобильноеУстройство;
		Запись.МеткаВремени = ТекущаяУниверсальнаяДатаВМиллисекундах();
		
		Запись.Записать(Истина);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура УдалитьПоток(Параметры) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Период,
		|	ИдентификаторЗаписи,
		|	ДокументОбмена,
		|	Штрихкод
		|ИЗ
		|	РегистрСведений.SUI_ПотокШтрихкодов
		|ГДЕ
		|	&Условия
		|ДЛЯ ИЗМЕНЕНИЯ
		|	РегистрСведений.SUI_ПотокШтрихкодов";
	
	Условия = Новый Массив();
	
	Для Каждого Параметр Из Параметры Цикл
		
		ТипЗначенияПараметра = ТипЗнч(Параметр.Значение);
		
		Если ТипЗначенияПараметра = Тип("Массив") Или
			ТипЗначенияПараметра = Тип("ФиксированныйМассив") Или
			ТипЗначенияПараметра = Тип("СписокЗначений") Тогда
			Условия.Добавить(Параметр.Ключ + " В (&" + Параметр.Ключ + ")");
		Иначе
			Условия.Добавить(Параметр.Ключ + " = &" + Параметр.Ключ);
		КонецЕсли;
		
		Запрос.УстановитьПараметр(Параметр.Ключ, Параметр.Значение);
		
	КонецЦикла;
	
	Условия = СтрСоединить(Условия, Символы.ПС + Символы.Таб + "И ");
	
	Если ПустаяСтрока(Условия) Тогда
		Условия = "ИСТИНА";
	КонецЕсли;
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Условия", Условия);
	
	НачатьТранзакцию();
	
	Попытка
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если Не РезультатЗапроса.Пустой() Тогда
			
			Выборка = РезультатЗапроса.Выбрать();
			
			Пока Выборка.Следующий() Цикл
				
				НаборЗаписей = СоздатьНаборЗаписей();
				НаборЗаписей.Отбор.Период.Установить(Выборка.Период);
				НаборЗаписей.Отбор.ИдентификаторЗаписи.Установить(Выборка.ИдентификаторЗаписи);
				НаборЗаписей.Отбор.ДокументОбмена.Установить(Выборка.ДокументОбмена);
				НаборЗаписей.Отбор.Штрихкод.Установить(Выборка.Штрихкод);
				НаборЗаписей.Записать(Истина);
				
			КонецЦикла;
			
		КонецЕсли;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

// Код процедур и функций

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ЗаписатьСопоставлениеШтрихкодовВФоне(Параметры, АдресРезультата) Экспорт
	
	ДополнительныеНастройки = SUI_НастройкиМетаданныхСервер.ПолучитьДополнительныеНастройки(
		Перечисления.SUI_ТаблицыИнтеграции.ШтрихкодыНоменклатуры);
	
	Если ДополнительныеНастройки = Неопределено Тогда
		Алгоритм = "";
	Иначе
		Алгоритм = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеНастройки, 
			"АлгоритмСозданияШтрихкодаНоменклатуры.Алгоритм", "", Тип("Строка"));
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.Проверить(Не ПустаяСтрока(Алгоритм),
		СтрШаблон(НСтр("ru = 'Отсутствует алгоритм выполнения записи сопоставления штрихкода номенклатуры.
		|Проверьте алгоритм в настройках штрихкодов номенклатуры подсистемы %1.'"), SUI_SimpleКлиентСервер.Представление()));
	
	Данные = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "Данные", Новый ТаблицаЗначений(), Тип("ТаблицаЗначений"));
	
	Колонки = "Штрихкод,Номенклатура,Характеристика,Упаковка";
	КолонкиВДанных = СтрРазделить(Колонки, ",");
	Для индекс = 0 По КолонкиВДанных.ВГраница() Цикл
		
		Если Данные.Колонки.Найти(КолонкиВДанных[индекс]) = Неопределено Тогда
			Данные.Колонки.Добавить(КолонкиВДанных[индекс]);
		КонецЕсли;
		
	КонецЦикла;
	
	Попытка
		
		Для Каждого СтрокаДанных Из Данные Цикл
			SUI_ШтрихкодыНоменклатуры.СоздатьШтрихкодНоменклатуры(Алгоритм, СтрокаДанных.Штрихкод, СтрокаДанных.Номенклатура, 
				СтрокаДанных.Характеристика, СтрокаДанных.Упаковка);
		КонецЦикла;
		
	Исключение
		SUI_ЖурналРегистрации.ЗаписьВЖурналРегистрации(SUI_ШтрихкодыНоменклатурыКлиентСервер.ИмяСобытия(), , 
			Метаданные.РегистрыСведений.SUI_ПотокШтрихкодов, , ИнформацияОбОшибке());
		ВызватьИсключение;
	КонецПопытки;
	
	Если ТипЗнч(АдресРезультата) = Тип("Строка") И ЭтоАдресВременногоХранилища(АдресРезультата) Тогда
		Результат = Новый Структура("ОбработанныеШтрихкоды", Данные.ВыгрузитьКолонку("Штрихкод"));
		ПоместитьВоВременноеХранилище(Результат, АдресРезультата);
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаписатьСопоставлениеШтрихкода(Алгоритм, Штрихкод, Номенклатура, Характеристика, Упаковка) Экспорт
	
	Попытка
		УстановитьБезопасныйРежим(Истина);
		SUI_ОбщегоНазначения.ПередВыполнениемПроизвольногоАлгоритма();
		Выполнить(Алгоритм);
		УстановитьБезопасныйРежим(Ложь);
	Исключение
		ШаблонСообщения = НСтр("ru = 'Ошибка выполнения алгоритма записи сопоставления штрихкода номенклатура.
		|Проверьте алгоритм в настройках штрихкодов номенклатуры подсистемы %1.
		|
		|%2'");
		ВызватьИсключение СтрШаблон(ШаблонСообщения, SUI_SimpleКлиентСервер.Представление(), 
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти

#КонецЕсли
